Repository: khanhbq56/money-tracking
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Message Content
vi: Nội dung tin nhắn

source: Voice Input
vi: Nhập bằng giọng nói

source: Transaction
vi: Giao dịch

source: User Message
vi: Tin nhắn người dùng

source: date_format
vi: dd/MM/yyyy

source: gemini_prompt_template
vi: Phân tích tin nhắn tiếng Việt sau và trả về JSON chính xác: Tin nhắn: "{message}" Trả về JSON với format này CHÍNH XÁC: {{ "type": "expense|saving|investment", "amount": số_tiền_VND_dương, "description": "mô_tả_ngắn_gọn", "category": "category_code", "confidence": 0.8, "icon": "emoji" }} Quy tắc phân loại: 1. CHI TIÊU (expense): - "coffee", "cafe", "cà phê" → type: "expense", category: "coffee", icon: "☕" - "ăn", "trưa", "sáng", "tối", "phở", "cơm", "bún" → type: "expense", category: "food", icon: "🍜" - "grab", "taxi", "xe ôm", "xăng", "uber" → type: "expense", category: "transport", icon: "🚗" - "mua sắm", "shopping", "áo", "quần", "giày" → type: "expense", category: "shopping", icon: "🛒" - "xem phim", "game", "giải trí" → type: "expense", category: "entertainment", icon: "🎬" - Mặc định khác → type: "expense", category: "other", icon: "📦" 2. TIẾT KIỆM (saving): - "tiết kiệm", "gửi ngân hàng", "save" → type: "saving", category: null, icon: "💰" 3. ĐẦU TƯ (investment): - "mua cổ phiếu", "đầu tư", "invest", "bitcoin", "crypto" → type: "investment", category: null, icon: "📈" 4. Trích xuất số tiền: - "25k" = 25000 - "1.5M" = 1500000 - "100" = 100000 (mặc định nghìn) Luôn trả về amount dương và confidence từ 0.6 đến 1.0.

source: Suggested Transaction
vi: Giao dịch được đề xuất

source: Is Confirmed
vi: Đã xác nhận

source: Has Voice Input
vi: Có nhập bằng giọng nói

source: Parsed Date
vi: Ngày đã phân tích

source: Vietnamese
vi: Tiếng Việt

source: Created At
vi: Được tạo lúc

source: ai_classification_response
vi: {icon} Phân loại: {type_display} - {description} ({amount:,.0f}₫)

source: Listening...
vi: Đang nghe...

source: Voice Input (Ctrl+Shift+V)
vi: Nhập bằng giọng nói (Ctrl+Shift+V)

source: Selected users marked as demo accounts.
vi: Người dùng được chọn đã được đánh dấu là tài khoản demo.

source: Mark as demo accounts
vi: Đánh dấu là tài khoản demo

source: Reset legal consent
vi: Đặt lại sự đồng ý pháp lý

source: Designates whether this is a temporary demo account.
vi: Chỉ định xem đây có phải là tài khoản demo tạm thời hay không.

source: Updated At
vi: Được cập nhật lúc

source: You must accept the terms and privacy policy
vi: Bạn phải chấp nhận các điều khoản và chính sách bảo mật

source: Demo account created successfully
vi: Tài khoản demo đã được tạo thành công

source: Failed to create demo account
vi: Không thể tạo tài khoản demo

source: Demo User
vi: Người dùng Demo

source: Logged out successfully
vi: Đăng xuất thành công

source: Expense Tracker
vi: Theo Dõi Chi Tiêu

source: AI Assistant
vi: Trợ Lý AI

source: Future Me Simulator
vi: Mô Phỏng Tương Lai

source: Privacy Policy
vi: Chính sách Bảo mật

source: back_to_app
vi: Quay lại Ứng dụng

source: Your privacy is important to us
vi: Quyền riêng tư của bạn rất quan trọng với chúng tôi

source: Last updated
vi: Cập nhật lần cuối

source: privacy_intro_text
vi: Money Tracker ("chúng tôi", "của chúng tôi") cam kết bảo vệ quyền riêng tư của bạn. Chính sách Bảo mật này giải thích cách chúng tôi thu thập, sử dụng, tiết lộ và bảo vệ thông tin của bạn khi sử dụng ứng dụng theo dõi tài chính của chúng tôi.

source: Data Collection
vi: Thu thập Dữ liệu

source: personal_information
vi: Thông tin Cá nhân

source: we_collect_minimal_personal_information
vi: Chúng tôi thu thập thông tin cá nhân tối thiểu:

source: email_address
vi: Địa chỉ email

source: for_account_auth
vi: Để xác thực và nhận dạng tài khoản

source: name
vi: Tên

source: from_google_oauth
vi: Họ và tên từ Google OAuth (tùy chọn hiển thị)

source: profile_picture_url
vi: URL ảnh đại diện

source: from_google_oauth_personalization
vi: Từ Google OAuth để cá nhân hóa

source: unique_identifier_oauth
vi: Mã định danh duy nhất cho xác thực OAuth

source: financial_data
vi: Dữ liệu Tài chính

source: transaction_records
vi: Hồ sơ giao dịch

source: amount_description_date
vi: Số tiền, mô tả và ngày tháng

source: financial_patterns
vi: Mẫu tài chính

source: aggregated_spending_saving
vi: Dữ liệu chi tiêu và tiết kiệm tổng hợp

source: ai_confidence_scores
vi: Điểm tin cậy AI

source: transaction_categorization_accuracy
vi: Để chính xác phân loại giao dịch

source: technical_data
vi: Dữ liệu Kỹ thuật

source: ip_address
vi: Địa chỉ IP

source: security_login_tracking
vi: Để bảo mật và theo dõi đăng nhập

source: session_data
vi: Dữ liệu phiên

source: maintaining_authenticated_sessions
vi: Để duy trì phiên xác thực

source: usage_analytics
vi: Phân tích sử dụng

source: feature_usage_improvement
vi: Sử dụng tính năng để cải thiện ứng dụng

source: How We Use Your Data
vi: Cách chúng tôi sử dụng Dữ liệu của bạn

source: Data Sharing Policy
vi: Chính sách Chia sẻ Dữ liệu

source: Data Security
vi: Bảo mật Dữ liệu

source: Demo Accounts
vi: Tài khoản Demo

source: Data Retention
vi: Lưu trữ Dữ liệu

source: Your Rights
vi: Quyền của bạn

source: Cookies & Local Storage
vi: Cookies & Lưu trữ Cục bộ

source: Children's Privacy
vi: Quyền riêng tư Trẻ em

source: Changes to This Policy
vi: Thay đổi Chính sách này

source: Contact Us
vi: Liên hệ chúng tôi

source: Terms of Service
vi: Điều khoản Dịch vụ

source: Please read these terms carefully
vi: Vui lòng đọc kỹ các điều khoản này

source: agreement_to_terms
vi: Đồng ý với Điều khoản

source: terms_agreement_text
vi: Bằng cách truy cập và sử dụng Money Tracker ("Dịch vụ"), bạn chấp nhận và đồng ý bị ràng buộc bởi các điều khoản và điều kiện của thỏa thuận này. Nếu bạn không đồng ý tuân thủ những điều trên, vui lòng không sử dụng dịch vụ này.

source: service_description
vi: Mô tả dịch vụ

source: service_description_text
vi: Money Tracker là ứng dụng quản lý tài chính cá nhân cung cấp:

source: service_features_1
vi: Theo dõi chi tiêu và thu nhập cá nhân

source: service_features_2
vi: Phân loại và báo cáo tài chính

source: service_features_3
vi: Phân tích giao dịch và thông tin chi tiết được hỗ trợ bởi AI

source: service_features_4
vi: Công cụ trực quan hóa dữ liệu và lập kế hoạch tài chính

source: service_features_5
vi: Tài khoản demo để dùng thử dịch vụ

source: account_types
vi: Loại Tài khoản

source: regular_accounts
vi: Tài khoản Thường

source: regular_account_feature_1
vi: Xác thực qua Google OAuth 2.0

source: regular_account_feature_2
vi: Lưu trữ dữ liệu vĩnh viễn cho đến khi xóa tài khoản

source: regular_account_feature_3
vi: Truy cập đầy đủ tất cả tính năng ứng dụng

source: regular_account_feature_4
vi: Chịu trách nhiệm về độ chính xác và quản lý dữ liệu

source: demo_accounts
vi: Tài khoản demo

source: demo_account_feature_1
vi: Truy cập tạm thời: Giới hạn 24 giờ

source: demo_account_feature_2
vi: Tự động xóa: Tất cả dữ liệu được xóa sau khi hết hạn

source: demo_account_feature_3
vi: Phạm vi hạn chế: Chỉ để đánh giá

source: demo_account_feature_4
vi: Không đảm bảo: Dữ liệu demo có thể được đặt lại hoặc không khả dụng

source: user_responsibilities
vi: Trách nhiệm Người dùng

source: user_responsibilities_text
vi: Bằng cách sử dụng dịch vụ của chúng tôi, bạn đồng ý:

source: user_responsibility_1
vi: Cung cấp thông tin chính xác và trung thực

source: user_responsibility_2
vi: Duy trì bảo mật thông tin đăng nhập tài khoản của bạn

source: user_responsibility_3
vi: Chỉ sử dụng dịch vụ để theo dõi tài chính cá nhân

source: user_responsibility_4
vi: Tuân thủ tất cả luật và quy định hiện hành

source: user_responsibility_5
vi: Không cố gắng dịch ngược hoặc khai thác dịch vụ

source: user_responsibility_6
vi: Không tạo nhiều tài khoản demo để lách quy định

source: user_responsibility_7
vi: Tôn trọng quyền sở hữu trí tuệ của dịch vụ

source: prohibited_uses
vi: Các Sử dụng Bị cấm

source: prohibited_uses_intro
vi: Bạn không được sử dụng dịch vụ của chúng tôi để:

source: prohibited_use_1
vi: Cho bất kỳ mục đích bất hợp pháp hoặc hoạt động bất hợp pháp nào

source: prohibited_use_2
vi: Vi phạm bất kỳ quy định hoặc luật pháp quốc tế, liên bang, tỉnh hoặc bang nào

source: prohibited_use_3
vi: Truyền mã độc hại, virus hoặc các tài liệu có hại khác

source: prohibited_use_4
vi: Mạo danh người khác hoặc tổ chức khác

source: prohibited_use_5
vi: Quấy rối, lạm dụng hoặc làm hại người khác

source: prohibited_use_6
vi: Thu thập hoặc thu hoạch thông tin về người dùng khác

source: prohibited_use_7
vi: Cho mục đích thương mại mà không có sự cho phép rõ ràng

source: data_and_privacy
vi: Dữ liệu và Quyền riêng tư

source: your_data_ownership
vi: Quyền sở hữu dữ liệu của bạn

source: your_data_ownership_desc
vi: Bạn giữ quyền sở hữu dữ liệu tài chính của mình

source: data_accuracy
vi: Độ chính xác dữ liệu

source: data_accuracy_desc
vi: Bạn chịu trách nhiệm về độ chính xác của dữ liệu đã nhập

source: privacy_protection
vi: Bảo vệ quyền riêng tư

source: privacy_protection_desc
vi: Chúng tôi bảo vệ dữ liệu của bạn như được nêu trong Chính sách Bảo mật

source: data_export
vi: Xuất dữ liệu

source: data_export_desc
vi: Bạn có thể xuất dữ liệu của mình bất cứ lúc nào

source: account_deletion
vi: Xóa tài khoản

source: account_deletion_desc
vi: Bạn có thể xóa tài khoản và dữ liệu của mình vĩnh viễn

source: ai_powered_features
vi: Tính năng được hỗ trợ bởi AI

source: ai_disclaimer_title
vi: Tuyên bố miễn trừ trách nhiệm AI

source: ai_disclaimer_text
vi: Các thông tin chi tiết và khuyến nghị được tạo bởi AI chỉ mang tính chất thông tin và không nên được coi là lời khuyên tài chính chuyên nghiệp.

source: ai_feature_1
vi: Các tính năng AI được cung cấp "như hiện tại" mà không đảm bảo độ chính xác

source: ai_feature_2
vi: Người dùng nên xác minh các đề xuất của AI trước khi đưa ra quyết định tài chính

source: ai_feature_3
vi: Điểm tin cậy AI chỉ ra sự chắc chắn của hệ thống, không phải chất lượng lời khuyên tài chính

source: ai_feature_4
vi: Chúng tôi liên tục cải thiện độ chính xác của AI nhưng không thể đảm bảo sự hoàn hảo

source: service_availability
vi: Tính khả dụng của Dịch vụ

source: service_availability_1
vi: Chúng tôi cố gắng có sẵn 24/7 nhưng không thể đảm bảo dịch vụ không bị gián đoạn

source: service_availability_2
vi: Bảo trì theo kế hoạch sẽ được thông báo trước khi có thể

source: service_availability_3
vi: Chúng tôi có quyền sửa đổi hoặc ngừng các tính năng với thông báo

source: service_availability_4
vi: Dịch vụ có thể tạm thời không khả dụng trong quá trình cập nhật hoặc sửa chữa

source: limitation_of_liability
vi: Giới hạn Trách nhiệm pháp lý

source: important_legal_notice
vi: Thông báo Pháp lý Quan trọng: Vui lòng đọc kỹ

source: liability_1
vi: Dịch vụ được cung cấp "như hiện tại" mà không có bảo hành dưới bất kỳ hình thức nào

source: liability_2
vi: Chúng tôi không chịu trách nhiệm cho các quyết định tài chính được đưa ra dựa trên dịch vụ của chúng tôi

source: liability_3
vi: Người dùng chịu trách nhiệm về việc quản lý và quyết định tài chính của riêng họ

source: liability_4
vi: Chúng tôi không chịu trách nhiệm về việc mất dữ liệu, mặc dù chúng tôi thực hiện các thủ tục sao lưu

source: liability_5
vi: Trách nhiệm của chúng tôi được giới hạn ở số tiền đã trả cho dịch vụ (nếu có)

source: liability_6
vi: Chúng tôi không chịu trách nhiệm cho các tích hợp hoặc dịch vụ của bên thứ ba

source: intellectual_property
vi: Sở hữu Trí tuệ

source: intellectual_property_1
vi: Money Tracker và nội dung gốc của nó được bảo vệ bởi bản quyền

source: intellectual_property_2
vi: Người dùng không được sao chép, phân phối hoặc sửa đổi nội dung của chúng tôi mà không có sự cho phép

source: intellectual_property_3
vi: Nội dung và thương hiệu của bên thứ ba vẫn thuộc sở hữu của chủ sở hữu tương ứng

source: intellectual_property_4
vi: Dữ liệu tài chính do người dùng tạo vẫn thuộc sở hữu của người dùng

source: account_termination
vi: Chấm dứt Tài khoản

source: user_initiated_termination
vi: Chấm dứt do Người dùng Khởi tạo

source: user_termination_1
vi: Bạn có thể xóa tài khoản của mình bất cứ lúc nào

source: user_termination_2
vi: Việc xóa tài khoản là vĩnh viễn và không thể hoàn tác

source: user_termination_3
vi: Tất cả dữ liệu liên quan sẽ bị xóa vĩnh viễn

source: user_termination_4
vi: Xuất dữ liệu của bạn trước khi xóa nếu cần

source: service_initiated_termination
vi: Chấm dứt do Dịch vụ Khởi tạo

source: service_termination_1
vi: Chúng tôi có quyền tạm ngừng tài khoản vì vi phạm điều khoản

source: service_termination_2
vi: Lạm dụng lặp lại có thể dẫn đến chấm dứt tài khoản vĩnh viễn

source: service_termination_3
vi: Chúng tôi sẽ thông báo trước khi chấm dứt khi có thể

source: service_termination_4
vi: Tài khoản demo tự động chấm dứt sau 24 giờ

source: changes_to_terms
vi: Thay đổi Điều khoản

source: changes_to_terms_1
vi: Chúng tôi có thể cập nhật các điều khoản này theo thời gian

source: changes_to_terms_2
vi: Các thay đổi đáng kể sẽ được thông báo qua email hoặc thông báo trong ứng dụng

source: changes_to_terms_3
vi: Việc tiếp tục sử dụng sau khi thay đổi cấu thành sự chấp nhận các điều khoản mới

source: changes_to_terms_4
vi: Người dùng không đồng ý với các thay đổi có thể chấm dứt tài khoản của họ

source: governing_law
vi: Luật Điều chỉnh

source: governing_law_text
vi: Các điều khoản và điều kiện này được điều chỉnh và giải thích theo luật pháp của khu vực pháp lý nơi Money Tracker hoạt động. Bất kỳ tranh chấp nào phát sinh từ các điều khoản này sẽ thuộc thẩm quyền độc quyền của các tòa án thích hợp.

source: contact_information
vi: Thông tin Liên hệ

source: contact_questions_text
vi: Nếu bạn có câu hỏi về các Điều khoản Dịch vụ này:

source: support
vi: Hỗ trợ

source: response_time
vi: Thời gian phản hồi

source: within_48_hours
vi: Trong vòng 48 giờ

source: languages
vi: Ngôn ngữ

source: vietnamese_english
vi: Tiếng Việt, Tiếng Anh

source: acknowledgment
vi: Xác nhận

source: acknowledgment_text
vi: Bằng cách sử dụng Money Tracker, bạn xác nhận rằng bạn đã đọc các Điều khoản Dịch vụ này, hiểu chúng và đồng ý bị ràng buộc bởi chúng. Nếu bạn không đồng ý với các điều khoản này, bạn không được sử dụng dịch vụ của chúng tôi.

source: how_we_use_your_data
vi: Cách chúng tôi sử dụng Dữ liệu của bạn

source: data_usage_1
vi: Cung cấp dịch vụ theo dõi và quản lý tài chính

source: data_usage_2
vi: Xác thực tài khoản của bạn và duy trì bảo mật

source: data_usage_3
vi: Tạo thông tin chi tiết và khuyến nghị tài chính được hỗ trợ bởi AI

source: data_usage_4
vi: Tạo bảng điều khiển và báo cáo được cá nhân hóa

source: data_usage_5
vi: Cải thiện các tính năng ứng dụng và trải nghiệm người dùng của chúng tôi

source: data_usage_6
vi: Gửi thông báo tài khoản quan trọng (cảnh báo đăng nhập, v.v.)

source: data_sharing_policy
vi: Chính sách Chia sẻ Dữ liệu

source: data_sharing_commitment
vi: Chúng tôi KHÔNG bán, trao đổi hoặc chia sẻ dữ liệu cá nhân của bạn với bên thứ ba.

source: limited_exceptions_intro
vi: Ngoại lệ hạn chế (chỉ khi được yêu cầu về mặt pháp lý):

source: exception_1
vi: Tuân thủ pháp luật khi được yêu cầu bởi cơ quan thực thi pháp luật

source: exception_2
vi: Bảo vệ quyền, tài sản hoặc sự an toàn của chúng tôi

source: exception_3
vi: Các tình huống khẩn cấp liên quan đến an toàn cá nhân

source: data_security
vi: Bảo mật Dữ liệu

source: encryption_in_transit
vi: Mã hóa trong quá trình truyền

source: encryption_in_transit_desc
vi: Tất cả dữ liệu được truyền qua HTTPS/SSL

source: encryption_at_rest
vi: Mã hóa khi lưu trữ

source: encryption_at_rest_desc
vi: Mã hóa cơ sở dữ liệu và lưu trữ tệp

source: secure_authentication
vi: Xác thực an toàn

source: secure_authentication_desc
vi: Google OAuth 2.0 với phạm vi tối thiểu

source: access_controls
vi: Kiểm soát truy cập

source: access_controls_desc
vi: Cách ly dữ liệu người dùng nghiêm ngặt

source: regular_security_audits
vi: Kiểm toán bảo mật thường xuyên

source: regular_security_audits_desc
vi: Giám sát bảo mật liên tục

source: demo_account_policy
vi: Chính sách Tài khoản Demo

source: demo_account_policy_text
vi: Tài khoản demo và tất cả dữ liệu liên quan được tự động xóa sau 24 giờ. Không thu thập thông tin cá nhân cho tài khoản demo.

source: data_retention
vi: Lưu trữ Dữ liệu

source: account_data
vi: Dữ liệu tài khoản

source: account_data_retention
vi: Được giữ lại cho đến khi xóa tài khoản

source: transaction_data
vi: Dữ liệu giao dịch

source: transaction_data_retention
vi: Được giữ lại cho chức năng tài khoản

source: demo_accounts_retention
vi: Tự động xóa sau 24 giờ

source: login_logs
vi: Nhật ký đăng nhập

source: login_logs_retention
vi: Được giữ lại trong 90 ngày cho mục đích bảo mật

source: your_rights
vi: Quyền của bạn

source: access
vi: Truy cập

source: access_desc
vi: Xem tất cả dữ liệu cá nhân của bạn mà chúng tôi lưu trữ

source: correction
vi: Sửa chữa

source: correction_desc
vi: Cập nhật hoặc sửa chữa thông tin của bạn

source: deletion
vi: Xóa

source: deletion_desc
vi: Xóa tài khoản và tất cả dữ liệu liên quan của bạn

source: export
vi: Xuất

source: export_desc
vi: Tải xuống dữ liệu giao dịch của bạn

source: restriction
vi: Hạn chế

source: restriction_desc
vi: Giới hạn cách chúng tôi xử lý dữ liệu của bạn

source: to_exercise_rights
vi: Để thực hiện quyền của bạn

source: contact_privacy_email
vi: Liên hệ với chúng tôi tại

source: cookies_local_storage
vi: Cookies & Lưu trữ Cục bộ

source: cookies_intro
vi: Chúng tôi sử dụng cookies và lưu trữ cục bộ tối thiểu:

source: session_cookies_desc
vi: Để xác thực và chức năng ứng dụng

source: preference_storage
vi: Lưu trữ tùy chọn

source: preference_storage_desc
vi: Ngôn ngữ, chủ đề và cài đặt người dùng

source: security_tokens
vi: Token bảo mật

source: security_tokens_desc
vi: Bảo vệ CSRF và trạng thái OAuth

source: childrens_privacy
vi: Quyền riêng tư Trẻ em

source: childrens_privacy_text
vi: Money Tracker không dành cho trẻ em dưới 18 tuổi. Chúng tôi không cố ý thu thập thông tin cá nhân từ trẻ em. Nếu bạn tin rằng chúng tôi đã thu thập thông tin từ một đứa trẻ, vui lòng liên hệ với chúng tôi ngay lập tức.

source: changes_to_policy
vi: Thay đổi Chính sách này

source: changes_to_policy_text
vi: Chúng tôi có thể cập nhật Chính sách Bảo mật này theo thời gian. Chúng tôi sẽ thông báo cho bạn về bất kỳ thay đổi nào bằng cách đăng Chính sách Bảo mật mới trên trang này và cập nhật ngày "Cập nhật lần cuối". Các thay đổi có hiệu lực ngay lập tức sau khi đăng.

source: contact_us
vi: Liên hệ chúng tôi

source: privacy_contact_intro
vi: Nếu bạn có câu hỏi về Chính sách Bảo mật này hoặc thực tiễn dữ liệu của chúng tôi:
